Revit 2027 API
View.HasDisplayStyle Method
 Indicates if view has a DisplayStyle property
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasDisplayStyle()
Public Function HasDisplayStyle As Boolean
public:
bool HasDisplayStyle()
member HasDisplayStyle : unit -> bool
Return Value
Boolean
 True if view has a DisplayStyle property
See Also
Reference
View Class
Autodesk.Revit.DB Namespace